tests/artillery/test.yaml
config:
  target: "http://localhost:80"
  #target: "http://34.64.243.135:3000"
  phases:
    - duration: 1
      arrivalRate: 10
      name: load test


scenarios:
  - name: "create one chunk and get"
    flow:
      - post:
          url: "/api/v1/chunks"
          json:
            source_wave_url: "super intensive discord webhook test"
          capture:
            - json: "$.data._id"
              as: "chunkId"
      - patch:
          url: "/api/v1/chunks/{{ chunkId }}"
          json:
            target_wave_url: "super intensive discord webhook test"
            status: "3"
            segments: [{
              start_time: 0,
              end_time: 0,
              source_text: "hihi",
              target_text: "안녕안녕"
            }]