tests/artillery/test.yaml
config:
    target: 'http://localhost:80'
    #target: 'http://34.64.86.184:3000'
    phases:
        - duration: 1
          arrivalRate: 1
          name: load test
    plugins:
        http-file-uploads:
            filePaths: '../../../minoi.mp3'

scenarios:
    - name: 'preprocess and upload, a create chunk, patch chunk'
      flow:
          - post:
                url: '/api/v1/audios/upload/preprocess'
                formData:
                    audio:
                        fromFile: '../../../minoi.mp3'
                capture:
                    - json: '$.data.mediaLink'
                      as: 'mediaLink'
          - post:
                url: '/api/v1/chunks/'
                json:
                    source_wave_url: '{{ mediaLink }}'
                capture:
                    - json: '$.data._id'
                      as: 'chunkId'
          - patch:
                url: '/api/v1/chunks/{{ chunkId }}'
                json:
                    status: '3'
                    target_wave_url: '{{ mediaLink }}'